package profJava.homework221121;
/*Сделать проект для Сотрудников компании. Должен быть класс Сотрудники, ЭНАМЫ с градацией должностей. Интерфейсы с фичами для каждого уровня должности. Наследники от главного класса будут ТОПы, Среднего звена, Рядовые сотрудники. Хранить сотрудников в папке model. Далее сделать класс базаДанных по аналогии с уроком. Хранить класс в папке bd. Сделать класс Сервис, который будет выполнять разного рода опреации, анпрмер смены должности итд. Хранить Сервисы в папке service*/
public class Employee {
}
